abbench_app2_test2.txt
This is ApacheBench, Version 2.3 <$Revision: 1604373 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Apache/2.4.10
Server Hostname:        localhost
Server Port:            80

Document Path:          /apps/app2/
Document Length:        10094 bytes

Concurrency Level:      100
Time taken for tests:   469.560 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      10332000 bytes
HTML transferred:       10094000 bytes
Requests per second:    2.13 [#/sec] (mean)
Time per request:       46955.975 [ms] (mean)
Time per request:       469.560 [ms] (mean, across all concurrent requests)
Transfer rate:          21.49 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2   6.2      0      23
Processing:  1752 44728 6095.1  45811   57828
Waiting:     1751 44726 6095.0  45809   57825
Total:       1774 44730 6091.5  45811   57851

Percentage of the requests served within a certain time (ms)
  50%  45811
  66%  45912
  75%  45974
  80%  46015
  90%  46092
  95%  46198
  98%  53109
  99%  55914
 100%  57851 (longest request)